# K Nearest Neighbors (KNN)

In [1]:
# classification algoritm generally used to predict categorical values.

In [3]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns
%matplotlib inline

#### Import the dataset

In [5]:
df = pd.read_csv('C:\\Users\\421803\\Desktop\\Tat\\Python\\ML Algorithms dataset\SocialNetworkAds.csv')

<>:1: SyntaxWarning: invalid escape sequence '\S'
<>:1: SyntaxWarning: invalid escape sequence '\S'
C:\Users\421803\AppData\Local\Temp\ipykernel_27112\2231421660.py:1: SyntaxWarning: invalid escape sequence '\S'
  df = pd.read_csv('C:\\Users\\421803\\Desktop\\Tat\\Python\\ML Algorithms dataset\SocialNetworkAds.csv')

In [6]:
df

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

#### Extracting the independent variables

In [8]:
X = df.iloc[:,[2,3]]
y = df['Purchased']

In [9]:
X

     Age  EstimatedSalary
0     19            19000
1     35            20000
2     26            43000
3     27            57000
4     19            76000
..   ...              ...
395   46            41000
396   51            23000
397   50            20000
398   36            33000
399   49            36000

[400 rows x 2 columns]

In [10]:
y

0      0
1      0
2      0
3      0
4      0
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchased, Length: 400, dtype: int64